/*
Задача 41: Пользователь вводит с клавиатуры M чисел. Посчитайте, сколько чисел больше 0 ввёл пользователь.

0, 7, 8, -2, -2 -> 2

1, -7, 567, 89, 223-> 3
*/

Console.Write("Введите числа: (через пробел): ");
int[] massive = Array.ConvertAll(Console.ReadLine().Split(), int.Parse);
int count = 0;
 
for (int i = 0; i < massive.Length; i++)
{
    if (massive[i] > 0)
    {
        count++;
    }
}
 
Console.WriteLine($"Кол-во элементов > 0: {count}");




// В УСЛОВИИ ЗАДАЧИ (В ПРИМЕРЕ: 1, -7, 567, 89, 223-> 3 ) ЕСТЬ ОШИБКА!!! ТАМ 4 ЭЛЕМЕНТА КОТОРЫЕ БОЛЬШЕ 0. А ИМЕННО 1,567,89,223.

// В ОСТАЛЬНОМ ВРОДЕ КАК ПРОГРАММА РАБОТАЕТ.